;; -*- no-byte-compile: t; -*-
;;; emacs/vc/packages.el

(package! vc :built-in t)
(package! vc-annotate :built-in t)
(package! smerge-mode :built-in t)

(package! browse-at-remote :pin "cef26f2c063f2473af42d0e126c8613fe2f709e4")
(package! git-commit :pin "b68a760c9e7694c687adedec7dffab0a5609ea93")
(package! git-timemachine :pin "8d675750e921a047707fcdc36d84f8439b19a907")
(package! gitconfig-mode :pin "7678ead3cdbb1692c9728b9730c016283ed97af1")
(package! gitignore-mode :pin "7678ead3cdbb1692c9728b9730c016283ed97af1")
