;; -*- no-byte-compile: t; -*-
;;; emacs/vc/packages.el

(package! vc :built-in t)
(package! vc-annotate :built-in t)
(package! smerge-mode :built-in t)

(package! browse-at-remote :pin "cef26f2c063f2473af42d0e126c8613fe2f709e4")
(package! git-commit :pin "1e40d0021790707f6e88debda04f6b14d9429586")
(package! git-timemachine :pin "3381797bcbf906b18dff654a2361032d2d01b4a3")
(package! gitconfig-mode :pin "433e1c57a63c88855fc41a942e29d7bc8c9c16c7")
(package! gitignore-mode :pin "433e1c57a63c88855fc41a942e29d7bc8c9c16c7")
