;; -*- no-byte-compile: t; -*-
;;; lang/scheme/packages.el

(when (package! geiser :pin "c5a9aae4d30ea6dbf2d8af4dd1cc35a839686a00")
  (package! macrostep-geiser :pin "8600fca05fd12a2e0ffe63238ddbfcb37c285dac")
  (when (featurep! +chez)
    (package! geiser-chez :pin "4cb7f2667ea1c53da53f0144910fbbd67bccbf4d"))
  (when (featurep! +chibi)
    (package! geiser-chibi :pin "54e7f384618c73d8fb675b5289d443a8ee3e4dc8"))
  (when (featurep! +chicken)
    (package! geiser-chicken :pin "47be5b43b35d3bf35b0f668b4c08715ea41fb97d"))
  (when (featurep! +gambit)
    (package! geiser-gambit :pin "0ee4156640988497779345452c3aa0417356e606"))
  (when (featurep! +gauche)
    (package! geiser-gauche :pin "66e51430bded0f0e2037f474818a7bbaafb2906c"))
  (when (featurep! +guile)
    (package! geiser-guile :pin "93ef7101fdfcc7eac6f465b4b9788c384a323c14")
    (when (featurep! :checkers syntax)
      (package! flycheck-guile
        :recipe (:host github :repo "flatwhatson/flycheck-guile")
        :pin "e46d6e5453dd7471309fae6549445c48e6d8f340")))
  (when (featurep! +kawa)
    (package! geiser-kawa :pin "b96c008e9c3b8dc210d8b536ee7b76b8690c8af6"))
  (when (featurep! +mit)
    (package! geiser-mit :pin "d17394f577aaa2854a74a1a0039cb8f73378b400"))
  (when (featurep! +racket)
    (package! geiser-racket :pin "a87fd449cc6c7b0b17a0b08268e78d3f038f3351")))
